{
  "do": [
    "Do you know the breed of the dog in the park? The breed of the dog in the park is [mask].",
    "Do you recognize the actor in the movie? The actor in the movie is [mask].",
    "Do you have information about the price of the new smartphone? The price of the new smartphone is [mask].",
    "Do you remember the title of the song playing on the radio? The title of the song playing on the radio is [mask].",
    "Do you understand the plot of the novel you're reading? The plot of the novel I'm reading is [mask].",
    "Do you have details about the ingredients in the recipe? The ingredients in the recipe are [mask].",
    "Do you notice the brand of the shoes the person is wearing? The brand of the shoes the person is wearing is [mask].",
    "Do you have any idea about the author of the article? The author of the article is [mask].",
    "Do you recognize the logo on the product packaging? The logo on the product packaging is [mask].",
    "Do you know the name of the mountain in the background of the photograph? The name of the mountain in the background of the photograph is [mask]."
  ],
  "is": [
    "Is the coffee in the mug hot or cold? The coffee in the mug is [mask].",
    "Is the building across the street tall or short? The building across the street is [mask].",
    "Is the laptop on the desk open or closed? The laptop on the desk is [mask].",
    "Is the cat in the picture sleeping or awake? The cat in the picture is [mask].",
    "Is the traffic light at the intersection red or green? The traffic light at the intersection is [mask].",
    "Is the movie you watched yesterday a comedy or a drama? The movie I watched yesterday is [mask].",
    "Is the weather outside today sunny or rainy? The weather outside today is [mask].",
    "Is the music playing in the background loud or soft? The music playing in the background is [mask].",
    "Is the door to the room open or closed? The door to the room is [mask].",
    "Is the person in the photograph smiling or serious? The person in the photograph is [mask]."
  ],
  "are": [
    "Are the people in the photograph smiling or serious? The people in the photograph are [mask].",
    "Are the shoes on the shelf new or old? The shoes on the shelf are [mask].",
    "Are the students in the classroom studying or taking a break? The students in the classroom are [mask].",
    "Are the lights in the room turned on or off? The lights in the room are [mask].",
    "Are the birds in the tree singing or quiet? The birds in the tree are [mask].",
    "Are the vegetables in the grocery basket fresh or wilted? The vegetables in the grocery basket are [mask].",
    "Are the glasses on the table empty or full? The glasses on the table are [mask].",
    "Are the houses on the street big or small? The houses on the street are [mask].",
    "Are the clouds in the sky fluffy or dark? The clouds in the sky are [mask].",
    "Are the employees in the office working or on a break? The employees in the office are [mask]."
  ],
  "was": [
    "Was the event you attended yesterday indoors or outdoors? The event I attended yesterday was [mask].",
    "Was the movie you watched last night a comedy or a drama? The movie I watched last night was [mask].",
    "Was the weather during your vacation sunny or rainy? The weather during my vacation was [mask].",
    "Was the restaurant you visited for lunch crowded or empty? The restaurant I visited for lunch was [mask].",
    "Was the play you saw at the theater entertaining or boring? The play I saw at the theater was [mask].",
    "Was the meeting you attended this morning long or short? The meeting I attended this morning was [mask].",
    "Was the traffic on the highway heavy or light? The traffic on the highway was [mask].",
    "Was the book you read last week fiction or non-fiction? The book I read last week was [mask].",
    "Was the music at the concert loud or soft? The music at the concert was [mask].",
    "Was the atmosphere at the party lively or subdued? The atmosphere at the party was [mask]."
  ],
  "who": [
    "Who is the person standing next to the car in the photograph? The person standing next to the car is [mask].",
    "Who is the author of the book on the shelf? The author of the book on the shelf is [mask].",
    "Who is the singer of the song playing on the radio? The singer of the song playing on the radio is [mask].",
    "Who is the actor in the movie you watched last night? The actor in the movie I watched last night is [mask].",
    "Who is the artist of the painting in the gallery? The artist of the painting in the gallery is [mask].",
    "Who is the person wearing the colorful dress in the picture? The person wearing the colorful dress is [mask].",
    "Who is the owner of the dog in the park? The owner of the dog in the park is [mask].",
    "Who is the chef who prepared the delicious meal? The chef who prepared the delicious meal is [mask].",
    "Who is the child playing with the toy in the living room? The child playing with the toy in the living room is [mask].",
    "Who is the speaker in the recorded audio clip? The speaker in the recorded audio clip is [mask]."
  ],
  "can": [
    "Can you tell me the name of the person in the photograph? The name of the person in the photograph is [mask].",
    "Can you describe the taste of the dish you had for lunch? The taste of the dish I had for lunch is [mask].",
    "Can you explain the concept behind the painting in the art gallery? The concept behind the painting in the art gallery is [mask].",
    "Can you identify the brand of the phone on the table? The brand of the phone on the table is [mask].",
    "Can you provide details about the ingredients in the recipe? The ingredients in the recipe are [mask].",
    "Can you share information about the location of the event? The location of the event is [mask].",
    "Can you guess the genre of the movie based on its trailer? The genre of the movie based on its trailer is [mask].",
    "Can you let me know the title of the song playing on the radio? The title of the song playing on the radio is [mask].",
    "Can you find out the author of the book on the shelf? The author of the book on the shelf is [mask].",
    "Can you describe the appearance of the person in the recorded audio clip? The appearance of the person in the recorded audio clip is [mask]."
  ],
  "why": [
    "Why is the sky blue during the day? The sky is blue during the day because [mask].",
    "Why is the business sign illuminated at night? The business sign is illuminated at night because [mask].",
    "Why is the flower in the garden wilting? The flower in the garden is wilting because [mask].",
    "Why is the book on the shelf recommended by many? The book on the shelf is recommended by many because [mask].",
    "Why is the person in the picture smiling? The person in the picture is smiling because [mask].",
    "Why is the car parked on the street with its hazard lights on? The car parked on the street has its hazard lights on because [mask].",
    "Why is the child’s shorts colorful? The child’s shorts are colorful because [mask].",
    "Why is the umbrella in the picture upside down? The umbrella in the picture is upside down because [mask].",
    "Why is the pillow the cat is on so fluffy? The pillow the cat is on is fluffy because [mask].",
    "Why is the floor of this area slippery when wet? The floor of this area is slippery when wet because [mask]."
  ],
  "how": [
    "How does the flower in the garden receive sunlight for photosynthesis? The flower in the garden receives sunlight for photosynthesis by [mask].",
    "How did the dress the person is wearing become so popular? The dress the person is wearing became popular because [mask].",
    "How is the car parked on the street able to stay in place on an incline? The car parked on the street stays in place on an incline by [mask].",
    "How can the color of the sky change during a sunset? The color of the sky can change during a sunset due to [mask].",
    "How did the child’s shorts become stained? The child’s shorts became stained because [mask].",
    "How does the lettering on the business sign stay visible during the night? The lettering on the business sign stays visible during the night through [mask].",
    "How does the pillow the cat is on provide comfort? The pillow the cat is on provides comfort through [mask].",
    "How did the book on the shelf become a bestseller? The book on the shelf became a bestseller due to [mask].",
    "How is the umbrella in the picture able to withstand strong winds? The umbrella in the picture withstands strong winds by [mask].",
    "How does the floor of this area maintain its shine and cleanliness? The floor of this area maintains its shine and cleanliness through [mask]."
  ],
  "has": [
    "Has the flower in the garden bloomed yet? The flower in the garden has [mask].",
    "Has the pillow the cat is on been washed recently? The pillow the cat is on has [mask].",
    "Has the child’s shorts been worn to school before? The child’s shorts have [mask].",
    "Has the lettering on the business sign been changed recently? The lettering on the business sign has [mask].",
    "Has the sky in the picture ever been captured during a sunrise? The sky in the picture has [mask].",
    "Has the car parked on the street ever been involved in an accident? The car parked on the street has [mask].",
    "Has the dress the person is wearing been tailored for a special occasion? The dress the person is wearing has [mask].",
    "Has the flower in the garden been watered today? The flower in the garden has [mask].",
    "Has the book on the shelf been recommended by a friend? The book on the shelf has [mask].",
    "Has the umbrella in the picture been used during a rainstorm? The umbrella in the picture has [mask]."
  ],
  "what": [
    "What type of flooring covers the area in this room? The flooring in this area is [mask].",
    "What material is the pillow the cat is on made of? The pillow the cat is on is made of [mask].",
    "What design is featured on the child’s shorts? The child’s shorts feature a [mask] design.",
    "What font style is used for the lettering on the business sign? The lettering on the business sign is in [mask] font.",
    "What atmospheric phenomenon is depicted in the sky in the picture? The sky in the picture shows [mask].",
    "What make and model is the car parked on the street? The car parked on the street is a [mask].",
    "What fabric is the dress the person is wearing made from? The dress the person is wearing is made from [mask] fabric.",
    "What species is the flower in the garden? The flower in the garden is a [mask].",
    "What genre does the book on the shelf belong to? The book on the shelf belongs to the [mask] genre.",
    "What pattern is featured on the umbrella in the picture? The umbrella in the picture has a [mask] pattern."
  ],
  "could": [
    "Could you identify the material of the flooring in this area? The flooring in this area could be made of [mask].",
    "Could you determine the brand of the pillow the cat is on? The pillow the cat is on could be from [mask].",
    "Could you describe the potential color of the child’s shorts? The child’s shorts could be [mask].",
    "Could you suggest a possible font style for the lettering on the business sign? The lettering on the business sign could be in [mask] font.",
    "Could you speculate on the atmospheric conditions influencing the color of the sky in the picture? The color of the sky in the picture could be influenced by [mask].",
    "Could you guess the potential color of the car parked on the street? The color of the car parked on the street could be [mask].",
    "Could you imagine the likely color of the dress the person is wearing? The color of the dress the person is wearing could be [mask].",
    "Could you propose a probable color for the flower in the garden? The color of the flower in the garden could be [mask].",
    "Could you hypothesize the color of the book on the shelf? The color of the book on the shelf could be [mask].",
    "Could you suggest a potential color for the umbrella in the picture? The color of the umbrella in the picture could be [mask]."
  ],
  "which": [
    "Which type of flooring is used in this area? The flooring in this area is made of [mask].",
    "Which brand does the pillow the cat is on belong to? The pillow the cat is on is from the brand [mask].",
    "Which color is predominant in the child’s shorts? The child’s shorts are predominantly [mask].",
    "Which font style is used for the lettering on the business sign? The lettering on the business sign is in [mask] font.",
    "Which shade is the dominant color of the sky in the picture? The sky in the picture is dominated by the color [mask].",
    "Which color characterizes the car parked on the street? The car parked on the street is [mask].",
    "Which hue describes the dress the person is wearing? The dress the person is wearing is [mask].",
    "Which color is most prominent in the flower in the garden? The flower in the garden is most prominently [mask].",
    "Which color defines the book on the shelf? The book on the shelf is [mask].",
    "Which color best describes the umbrella in the picture? The umbrella in the picture is [mask]."
  ],
  "did the": [
    "Did the flooring in this area undergo recent renovations? The flooring in this area did [mask].",
    "Did the pillow the cat is on come with the new sofa? The pillow the cat is on did [mask].",
    "Did the child’s shorts receive a design award? The child’s shorts did [mask].",
    "Did the lettering on the business sign change after the rebranding? The lettering on the business sign did [mask].",
    "Did the sky in the picture appear cloudy during the morning? The sky in the picture did [mask].",
    "Did the car parked on the street pass its recent inspection? The car parked on the street did [mask].",
    "Did the dress the person is wearing belong to a famous designer? The dress the person is wearing did [mask].",
    "Did the flower in the garden survive the recent storm? The flower in the garden did [mask].",
    "Did the book on the shelf become a bestseller last year? The book on the shelf did [mask].",
    "Did the umbrella in the picture protect against the rain during the hike? The umbrella in the picture did [mask]."
  ],
  "will the": [
    "Will the flooring in this area be replaced during the upcoming renovation? The flooring in this area will [mask].",
    "Will the pillow the cat is on be included in the new furniture set? The pillow the cat is on will [mask].",
    "Will the child’s shorts be available in different colors next season? The child’s shorts will [mask].",
    "Will the lettering on the business sign be updated to a modern font? The lettering on the business sign will [mask].",
    "Will the sky in the picture change color as the sun sets? The sky in the picture will [mask].",
    "Will the car parked on the street be moved before street cleaning tomorrow? The car parked on the street will [mask].",
    "Will the dress the person is wearing be featured in the upcoming fashion show? The dress the person is wearing will [mask].",
    "Will the flower in the garden bloom in the spring? The flower in the garden will [mask].",
    "Will the book on the shelf be part of the library's upcoming book sale? The book on the shelf will [mask].",
    "Will the umbrella in the picture protect against heavy rain? The umbrella in the picture will [mask]."
  ]
}
