{
  "who": [
    "Who is the person standing next to the car? The person standing next to the car is [mask].",
    "Who is the author of the book on the shelf? The author of the book on the shelf is [mask].",
    "Who is the singer of the song playing on the radio? The singer of the song playing on the radio is [mask].",
    "Who is the actor in the movie you watched last night? The actor in the movie you watched last night is [mask].",
    "Who is the artist of the painting in the gallery? The artist of the painting in the gallery is [mask].",
    "Who is the person wearing the colorful dress in the picture? The person wearing the colorful dress in the picture is [mask].",
    "Who is the owner of the dog in the park? The owner of the dog in the park is [mask].",
    "Who is the chef who prepared the delicious meal? The chef who prepared the delicious meal is [mask].",
    "Who is the child playing with the toy in the living room? The child playing with the toy in the living room is [mask].",
    "Who is the speaker in the recorded audio clip? The speaker in the recorded audio clip is [mask]."
  ],
  "what is": [
    "What is the population of Tokyo? The population of Tokyo is [mask].",
    "What is the height of Mount Everest? The height of Mount Everest is [mask].",
    "What is the temperature of boiling water? The temperature of boiling water is [mask].",
    "What is the length of the Great Wall of China? The length of the Great Wall of China is [mask].",
    "What is the weight of an average elephant? The weight of an average elephant is [mask].",
    "What is the diameter of the Moon? The diameter of the Moon is [mask].",
    "What is the duration of a solar eclipse? The duration of a solar eclipse is [mask].",
    "What is the depth of the Pacific Ocean? The depth of the Pacific Ocean is [mask].",
    "What is the lifespan of a butterfly? The lifespan of a butterfly is [mask].",
    "What is the size of the Sahara Desert? The size of the Sahara Desert is [mask].",
    "What is the speed of sound in air? The speed of sound in air is [mask].",
    "What is the length of the Nile River? The length of the Nile River is [mask].",
    "What is the diameter of Jupiter? The diameter of Jupiter is [mask].",
    "What is the capacity of the human brain? The capacity of the human brain is [mask].",
    "What is the wingspan of an albatross? The wingspan of an albatross is [mask].",
    "What is the distance from the Earth to the Sun? The distance from the Earth to the Sun is [mask].",
    "What is the density of gold? The density of gold is [mask].",
    "What is the length of the Amazon River? The length of the Amazon River is [mask].",
    "What is the age of the oldest known tree? The age of the oldest known tree is [mask].",
    "What is the size of the Great Barrier Reef? The size of the Great Barrier Reef is [mask]."
  ],
  "what color": [
    "What color are the unopened rolls of paper in the picture? The unopened rolls of paper are [mask].",
    "What color is the closest airplane? The closest airplane is [mask].",
    "What color are the different types of doors visible? The different types of doors are [mask].",
    "What color shirts are people wearing? People are wearing shirts that are [mask].",
    "What color are the books on the top shelf? The books on the top shelf are [mask].",
    "What color are the red balloons in the bunch? The red balloons in the bunch are [mask].",
    "What color is the bicycle parked outside? The bicycle parked outside is [mask].",
    "What color is the science fair attendees' attire? The science fair attendees' attire is [mask].",
    "What color is the remaining pizza in the box? The remaining pizza in the box is [mask].",
    "What color are the chairs in the conference room? The chairs in the conference room are [mask]."
  ],
  "what kind": [
    "What kind of rolls of paper are in the picture? The rolls of paper in the picture are [mask].",
    "What kind of engines does the closest airplane have? The closest airplane has [mask] engines.",
    "What kind of doors are visible? The doors visible are [mask] kinds.",
    "What kind of shirts are people wearing? People are wearing shirts that are [mask].",
    "What kind of books are on the top shelf? The books on the top shelf are [mask].",
    "What kind of balloons are in the bunch? The balloons in the bunch are [mask].",
    "What kind of bicycle is parked outside? The bicycle parked outside is [mask].",
    "What kind of attire did science fair attendees choose? Science fair attendees chose attire that is [mask].",
    "What kind of pizza is left in the box? The pizza left in the box is [mask].",
    "What kind of chairs are in the conference room? The chairs in the conference room are [mask]."
  ],
  "what are": [
    "What are the students in the classroom doing? The students in the classroom are [mask].",
    "What are the ingredients in the recipe? The ingredients in the recipe are [mask].",
    "What are the colors of the rainbow? The colors of the rainbow are [mask].",
    "What are the people in the park doing? The people in the park are [mask].",
    "What are the books on the shelf? The books on the shelf are [mask].",
    "What are the tools in the toolbox? The tools in the toolbox are [mask].",
    "What are the children in the playground doing? The children in the playground are [mask].",
    "What are the items on the grocery list? The items on the grocery list are [mask].",
    "What are the animals in the zoo doing? The animals in the zoo are [mask].",
    "What are the scientists in the lab working with? The scientists in the lab are working with [mask]."
  ],  
  "what type": [
    "What type of paper is used in the picture? The paper used in the picture is of [mask] type.",
    "What type of engines power the closest airplane? The closest airplane is powered by [mask] type of engines.",
    "What type of doors are visible? The doors visible are of [mask] type.",
    "What type of shirts are people wearing? People are wearing shirts that are [mask] in type.",
    "What type of books are on the top shelf? The books on the top shelf are [mask] in type.",
    "What type of balloons are in the bunch? The balloons in the bunch are [mask] in type.",
    "What type of bicycle is parked outside? The bicycle parked outside is [mask] in type.",
    "What type of attire did science fair attendees choose? Science fair attendees chose attire that is [mask] in type.",
    "What type of pizza is left in the box? The pizza left in the box is [mask] in type.",
    "What type of chairs are in the conference room? The chairs in the conference room are [mask] in type."
  ],
  "what does": [
    "What does the roll of paper in the picture represent? The roll of paper in the picture represents [mask].",
    "What does the engine of the closest airplane symbolize? The engine of the closest airplane symbolizes [mask].",
    "What does the arrangement of doors visible convey? The arrangement of doors visible conveys [mask].",
    "What does the clothing people are wearing express? The clothing people are wearing expresses [mask].",
    "What does the selection of books on the top shelf indicate? The selection of books on the top shelf indicates [mask].",
    "What does the presence of red balloons in the bunch suggest? The presence of red balloons in the bunch suggests [mask].",
    "What does the bicycle parked outside signify? The bicycle parked outside signifies [mask].",
    "What does the attire chosen by science fair attendees communicate? The attire chosen by science fair attendees communicates [mask].",
    "What does the remaining pizza in the box reveal? The remaining pizza in the box reveals [mask].",
    "What does the arrangement of chairs in the conference room reflect? The arrangement of chairs in the conference room reflects [mask]."
  ],  
  "why": [
    "Why is the ground surface near the train a different color? The ground surface near the train is in a different color because of [mask].",
    "Why is the cat under an umbrella? The cat under an umbrella is because of [mask].",
    "Why is the laptop sitting above a larger keyboard? The laptop is sitting above a larger keyboard because of [mask].",
    "Why is the car being towed? The car is being towed because of [mask].",
    "Why is the ice cream melting so quickly? The ice cream is melting quickly because of [mask].",
    "Why is the child wearing a raincoat on a sunny day? The child is wearing a raincoat on a sunny day because of [mask].",
    "Why is the building surrounded by scaffolding? The building is surrounded by scaffolding because of [mask].",
    "Why is the computer screen displaying an error message? The computer screen is displaying an error message because of [mask].",
    "Why is the tree leaning to one side? The tree is leaning to one side because of [mask].",
    "Why is the playground empty on a Saturday afternoon? The playground is empty on a Saturday afternoon because of [mask]."
  ],
  "how many": [
    "How many flowers are in the garden? The number of flowers in the garden is [mask].",
    "How many pages are in the book? The number of pages in the book is [mask].",
    "How many students are in the classroom? The number of students in the classroom is [mask].",
    "How many days are in a week? The number of days in a week is [mask].",
    "How many apples are in the basket? The number of apples in the basket is [mask].",
    "How many planets are in our solar system? The number of planets in our solar system is [mask].",
    "How many colors are in a rainbow? The number of colors in a rainbow is [mask].",
    "How many lakes are in the Great Lakes? The number of lakes in the Great Lakes is [mask].",
    "How many people attended the event? The number of people who attended the event is [mask].",
    "How many stars are in the constellation Orion? The number of stars in the constellation Orion is [mask].",
    "How many movies are in the Harry Potter series? The number of movies in the Harry Potter series is [mask].",
    "How many legs does a cat have? The number of legs a cat has is [mask].",
    "How many episodes are in the TV show Friends? The number of episodes in the TV show Friends is [mask].",
    "How many cups are in a quart? The number of cups in a quart is [mask].",
    "How many wheels does a tricycle have? The number of wheels on a tricycle is [mask].",
    "How many goals were scored in the soccer match? The number of goals scored in the soccer match is [mask].",
    "How many elements are in the human body? The number of elements in the human body is [mask].",
    "How many seconds are in a minute? The number of seconds in a minute is [mask].",
    "How many chapters are in the book series? The number of chapters in the book series is [mask].",
    "How many questions are in the exam? The number of questions in the exam is [mask]."
  ], 
  "where is": [
    "Where is the nearest grocery store located? The nearest grocery store is in [mask].",
    "Where is the closest gas station? The closest gas station is in [mask].",
    "Where is the Eiffel Tower situated? The Eiffel Tower is in [mask].",
    "Where is the meeting room for the conference scheduled? The meeting room for the conference is in [mask].",
    "Where is the Lost and Found department in this building? The Lost and Found department is in [mask].",
    "Where is the train station in this city? The train station is in [mask].",
    "Where is the designated smoking area? The designated smoking area is in [mask].",
    "Where is the entrance to the museum located? The entrance to the museum is in [mask].",
    "Where is the passport office in the government building? The passport office is in [mask].",
    "Where is the best spot to watch the sunrise? The best spot to watch the sunrise is in [mask]."
  ],
  "do": [
    "Do the cat chase mice? The cat chase mice [mask].",
    "Do the sun set in the west? The sun set in the west [mask].",
    "Do the car have four doors? The car have four doors [mask].",
    "Do the flower need sunlight? The flower need sunlight [mask].",
    "Do the clock tick loudly? The clock tick loudly [mask].",
    "Does the river flow downstream? The river flow downstream [mask].",
    "Does the moonlight shine at night? The moonlight shine at night [mask].",
    "Does the plant require watering? The plant require watering [mask].",
    "Does the pen write in black ink? The pen write in black ink [mask].",
    "Does the door open easily? The door open easily [mask]."
  ],
  "where are": [
    "Where are the nearest grocery stores located? The nearest grocery stores are in [mask].",
    "Where are the closest gas stations? The closest gas stations are in [mask].",
    "Where are the famous landmarks in the city? The famous landmarks in the city are in [mask].",
    "Where are the meeting rooms for the conference scheduled? The meeting rooms for the conference are in [mask].",
    "Where are the Lost and Found departments in this building? The Lost and Found departments are in [mask].",
    "Where are the train stations in this city? The train stations are in [mask].",
    "Where are the designated smoking areas? The designated smoking areas are in [mask].",
    "Where are the entrances to the museums located? The entrances to the museums are in [mask].",
    "Where are the passport offices in the government building? The passport offices are in [mask].",
    "Where are the best spots to watch the sunrise? The best spots to watch the sunrise are in [mask]."
  ],
  "is": [
    "Is the cat on the windowsill sleeping? The cat on the windowsill is [mask].",
    "Is the coffee in the mug hot? The coffee in the mug is [mask].",
    "Is the computer on the desk turned on? The computer on the desk is [mask].",
    "Is the book on the shelf fiction? The book on the shelf is [mask].",
    "Is the plant on the windowsill thriving? The plant on the windowsill is [mask].",
    "Is the car in the garage new? The car in the garage is [mask].",
    "Is the music in the room loud? The music in the room is [mask].",
    "Is the cake on the counter homemade? The cake on the counter is [mask].",
    "Is the street outside busy? The street outside is [mask].",
    "Is the phone in your hand ringing? The phone in your hand is [mask]."
  ],  
  "are": [
    "Are the people in the photograph smiling or serious? The people in the photograph are [mask].",
    "Are the shoes on the shelf new or old? The shoes on the shelf are [mask].",
    "Are the students in the classroom studying or taking a break? The students in the classroom are [mask].",
    "Are the lights in the room turned on or off? The lights in the room are [mask].",
    "Are the birds in the tree singing or quiet? The birds in the tree are [mask].",
    "Are the vegetables in the grocery basket fresh or wilted? The vegetables in the grocery basket are [mask].",
    "Are the glasses on the table empty or full? The glasses on the table are [mask].",
    "Are the houses on the street big or small? The houses on the street are [mask].",
    "Are the clouds in the sky fluffy or dark? The clouds in the sky are [mask].",
    "Are the employees in the office working or on a break? The employees in the office are [mask]."
  ]  
}
